def point_location():
    x = float(input("Введіть координату x: "))
    y = float(input("Введіть координату y: "))

    if x == 0 and y == 0:
        print("Точка знаходиться в початку координат.")
    elif x == 0:
        print("Точка знаходиться на осі Y.")
    elif y == 0:
        print("Точка знаходиться на осі X.")
    elif x > 0 and y > 0:
        print("Точка знаходиться в першому квадранті.")
    elif x < 0 and y > 0:
        print("Точка знаходиться в другому квадранті.")
    elif x < 0 and y < 0:
        print("Точка знаходиться в третьому квадранті.")
    else:
        print("Точка знаходиться в четвертому квадранті.")

point_location()
